In [ ]:
#used for data analysis,cleaning,preparation and visualization
#can work with data from a wide variety of sources

In [ ]:
#Series--similar to/built on top of numpy array. However Series has access labels. check the parameters to be passed to Series in the docs suggestion here

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [ ]:
#we can specify what index we want

In [4]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
#creating another Series by passing numpy array. if you pass a dictionary, the keys are automatically taken as index. Can also hold different object types

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=[sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [9]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [ ]:
#grab information from the series.similar to key-value pair of dictionary.
#whenever you perform some operation on series, the integers will be converted to float to prevent loss of data. see ser1+ser2 example

In [11]:
ser1['USA']

1

In [12]:
ser2['Italy']

5

In [13]:
ser3=pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [14]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames. We will work mainly with dataframes and not series

In [18]:
from numpy.random import randn

In [ ]:
#seed--to get the same random numbers

In [19]:
np.random.seed(101)

In [ ]:
#if randn(5,4),['A','B','C','D'],['W','X','Y','Z'] then error, as in randn--5 rows, 4 columns, A-D correspond to rows and W-Z 
#correspond to columns. so we must have a,b,c,d,e only then corresponds to 5 rows
#to return a sample from a random normal or gaussian distribution centred around 0, use randn(). Once againg the set of values will be different every time you execute
#randn(x,y)--for a 2-d array where x and y denote rows and column numbers

In [20]:
df=pd.DataFrame(randn(5,4),['A','B','C','D'],['W','X','Y','Z'])
df

ValueError: Shape of passed values is (4, 5), indices imply (4, 4)

In [ ]:
#if you observe the output of below mentioned code, W, X, Y and Z can be viewed as individual series. SO
#dataframe is just a bunch of series sharing the same index

In [22]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [23]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [24]:
type(df['W'])

pandas.core.series.Series

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df['W','Z']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [ ]:
#list of columns

In [27]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [28]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [ ]:
#creating a new column

In [29]:
df['new']=df['W']+df['Y']

In [30]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [ ]:
#drop a column. df.drop() by default works around axis=0 which is row. to drop a column axis=1 needs to bementioned

In [31]:
df.drop('new')

KeyError: "labels ['new'] not contained in axis"

In [32]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [33]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [ ]:
#inplace arguments=True so as to make these changes of dropping a column on the df. else as seen above the new column is still there
#so lets drop the new column permanently. SImilarly rows can also be dropped from df

In [34]:
df.drop('new',axis=1,inplace=True)

In [35]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [ ]:
#selecting rows. Also see the docstring--it is interpreted as the label and not the index position. Output will once again be a series
#so be it columns or rows, individually they are series. Use iloc to access by index position

In [36]:
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [37]:
df.iloc[2]

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

In [ ]:
#selecting subsets of rows and columns

In [38]:
df.loc['B','Y']

-0.031579143908112575

In [39]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

In [40]:
#Conditional selection
df>0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [41]:
df[df>0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [42]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [43]:
df['W']>0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [ ]:
#returns only those records(b c d) where value was true

In [44]:
df[df['W']>0]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [45]:
df['Z']<0

A    False
B    False
C     True
D    False
E    False
Name: Z, dtype: bool

In [46]:
df[df['Z']<0]

          W         X         Y         Z
C  2.154846 -0.610259 -0.755325 -0.346419

In [47]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [48]:
df[df['W']>0]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [49]:
df[df['W']>0]['X']

B   -0.156598
C   -0.610259
D   -0.479448
Name: X, dtype: float64

In [ ]:
#to extract 2 or more columns like X and Y, we have to pass a list of column names

In [50]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [51]:
df[df['W']>0][['X','Y']]

          X         Y
B -0.156598 -0.031579
C -0.610259 -0.755325
D -0.479448  0.558769

In [ ]:
# 'and' operator works on a set of values like --True and False. you can see one value on each side of 'and'. HOwever using and operator
#with Series will give an error of ambiguity, because it cannot work on series of values. It is not like dbms

In [53]:
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [52]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [54]:
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [ ]:
#similarly for or use |

In [55]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [ ]:
#resetting the index. reset_index(). a new column by the name 'index'. you can use inplace=True also as parameter

In [56]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [57]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [59]:
newind='CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [60]:
df['States']=newind

In [61]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [ ]:
#if we want to make States as the index use set_index(column name to made index)

In [62]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [63]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [ ]:
#Some more examples

In [65]:
outside=['G1','G1','G1','G2','G2','G2']

In [66]:
inside=[1,2,3,1,2,3]

In [67]:
hier_index=list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [68]:
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [ ]:
#list(zip(outside,inside))--returns a list of tuple pairs

In [ ]:
list(zip(outside,inside))

In [ ]:
#we willl talk about Multiindex.from_tuples later

In [69]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [ ]:
#calling data from multilevelindex. start from outside and keep going further in

In [70]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [71]:
df.loc['G1'].iloc[2]

A    0.681209
B    1.035125
Name: 3, dtype: float64

In [ ]:
#providing column names to columns having G1,G2 and the ones containing 1,2,3

In [72]:
df.index.names=['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [73]:
df.loc['G2'].iloc[1]['B']

-0.7417897046689249

In [75]:
#this is a bit difficult. using cross-section method xs(x,level=y). x--which row inside G1 and G2(its the first one in both. 1 doesnt mean here the index position)
#level=Num
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [74]:
df.xs(1,level='Num')

              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932

In [ ]:
#if your data has missing points, pandas automatically fills it with NaN, null value. use dropna()/fillna() to drop/fill missing values

In [76]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [77]:
df=pd.DataFrame(d)

In [78]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
#df.dropna()--check docstring. works by default along rows--axis=0. how=any--this means that it will drop all row/column(depending upon the axis) where Nan is present as value
#where it will find missing value. Using threshold=some value, we can set how many non-Nan values must be present. if some row/column is not satisfying the threshold those will be dropped

In [79]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [80]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [81]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [82]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
#replacing the missing values,i.e, replacing Nan

In [83]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [ ]:
#to fill mean of the column

In [84]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [ ]:
#groupby and aggrgate functions

In [85]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [86]:
df=pd.DataFrame(data)

In [87]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [88]:
byComp=df.groupby('Company')
byComp

In [89]:
byComp.mean()
#the string based columns like Person will be ignored by Pandas

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [90]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [91]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [92]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [93]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [94]:
byComp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [95]:
byComp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [96]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [97]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [98]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
#mergining, joining and concatenating dataframes

In [99]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [100]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [101]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [102]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [103]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [104]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation
#Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are #concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [105]:
pd.concat([df1,df2,df3])
#concatenating along row, axis=0 default

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [106]:
pd.concat([df1,df2,df3],axis=1)
#notice the Nans

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging

In [107]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [108]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [109]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [110]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
#more complex example

In [111]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [112]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [113]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [114]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [115]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining
#Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result #DataFrame.

In [116]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [117]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [118]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [119]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [120]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [ ]:
#OPerations

In [121]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
#info on unique values. Also try df['col2'].unique --observe the output. IN this case it will be a series

In [122]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [ ]:
#no of unique values

In [123]:
df['col2'].nunique()

3

In [ ]:
#how many times each value is appearing in the specific column

In [124]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [125]:
#Select from DataFrame using criteria from multiple columns
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [126]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [127]:
#Applying Functions
def times2(x):
    return x*2
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [128]:
df['col2'].apply(lambda var:var*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [129]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [130]:
#int type object has no length
df['col2'].apply(len)

TypeError: object of type 'int' has no len()

In [131]:
df['col2'].sum()

2109

In [132]:
#permanently removing column--here no need of inplace=True
del df['col1']

In [133]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [134]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [135]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [136]:
#sorting and ordering a dataframe--by default ascending=True
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [137]:
df.sort_values(by='col2',ascending=False)

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

In [138]:
#find/check for nulls
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [ ]:
#drop rows with nulls/NaN
df.dropna()

In [ ]:
#filling NaN values with something else
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

In [ ]:
df.fillna('FILL')

In [139]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [140]:
#values are taken from D column, index gets created on A and B colums, and the columns are values for column C which are x and y
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [ ]:
#pandas can read and write data to a wide variety of data sources
#ensure that the files are residing in your jupyter notebook workspace, else mention the complete path
#use pd.read_ and press tab to check the variety of options from where pandas can read. Similarly use df.to_ tab to see the variety of files the content can be written to

In [141]:
df=pd.read_csv('D:/AUS_Batch_ILP/DataScience_AusBatch/PythonForDataScience-Demos/Salaries.csv')

In [143]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [144]:
df.to_csv('My_output')

In [ ]:
pd.read_csv('My_output')

In [ ]:
#always use index=False
df.to_csv('My_output',index=False)

In [ ]:
df

In [ ]:
pd.read_csv('My_output')

In [ ]:
#importing excel--can import data but not formulas. A workbook is a bunch of sheets and each sheet is a dataframe
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [ ]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='MySheet')

In [ ]:
pd.read_excel('Excel_Sample2.xlsx',sheet_name='MySheet')

In [ ]:
#reading html---fdic.gov failed bank list page --- 
#conda install html5lib,lxml,sqlalchemy,BeautifulSoup4